tomvictor/CC2650-BLE-interrupt/Debug/configPkg/package/cfg/pinInterrupt_pm3g.c
xdc_Void * const ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_TimestampProvider_get32__E __attribute__((section (".rodata_ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_TimestampProvider_get32__E")));
xdc_Void * const ti_sysbios_rom_ROM_ti_sysbios_family_arm_cc26xx_TimestampProvider_get32__E = (xdc_Void *)ti_sysbios_family_arm_cc26xx_TimestampProvider_get32__E;

xdc_Void * const ti_sysbios_rom_ROM_ti_sysbios_knl_Clock_workFuncDynamic__E __attribute__((section (".rodata_ti_sysbios_rom_ROM_ti_sysbios_knl_Clock_workFuncDynamic__E")));
xdc_Void * const ti_sysbios_rom_ROM_ti_sysbios_knl_Clock_workFuncDynamic__E = (xdc_Void *)ti_sysbios_knl_Clock_workFuncDynamic__E;

/*
 *  generated functions referenced from within the ROM
 */
xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_Startup_getState__I __attribute__((section (".rodata_ti_sysbios_rom_ROM_xdc_runtime_Startup_getState__I")));
xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_Startup_getState__I = (xdc_Void *)xdc_runtime_Startup_getState__I;

xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_Module__startupDone__S __attribute__((section (".rodata_ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_Module__startupDone__S")));
xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_Module__startupDone__S = (xdc_Void *)xdc_runtime_System_SupportProxy_Module__startupDone__S;

xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_abort__E __attribute__((section (".rodata_ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_abort__E")));
xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_abort__E = (xdc_Void *)xdc_runtime_System_SupportProxy_abort__E;

xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_exit__E __attribute__((section (".rodata_ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_exit__E")));
xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_exit__E = (xdc_Void *)xdc_runtime_System_SupportProxy_exit__E;

xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_flush__E __attribute__((section (".rodata_ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_flush__E")));
xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_flush__E = (xdc_Void *)xdc_runtime_System_SupportProxy_flush__E;

xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_putch__E __attribute__((section (".rodata_ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_putch__E")));
xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_putch__E = (xdc_Void *)xdc_runtime_System_SupportProxy_putch__E;

xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_ready__E __attribute__((section (".rodata_ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_ready__E")));
xdc_Void * const ti_sysbios_rom_ROM_xdc_runtime_System_SupportProxy_ready__E = (xdc_Void *)xdc_runtime_System_SupportProxy_ready__E;



/*
 * ======== ti.sysbios.rom.cortexm.cc26xx.CC26xx TEMPLATE ========
 */



xdc_Void * const ti_sysbios_rom_ROM_AONRTCChannelEnable __attribute__((section (".rodata_ti_sysbios_rom_ROM_AONRTCChannelEnable")));
xdc_Void * const ti_sysbios_rom_ROM_AONRTCChannelEnable = (xdc_Void *)NULL;

xdc_Void * const ti_sysbios_rom_ROM_AONRTCCompareValueSet __attribute__((section (".rodata_ti_sysbios_rom_ROM_AONRTCCompareValueSet")));
xdc_Void * const ti_sysbios_rom_ROM_AONRTCCompareValueSet = (xdc_Void *)NULL;

xdc_Void * const ti_sysbios_rom_ROM_AONRTCCurrentCompareValueGet __attribute__((section (".rodata_ti_sysbios_rom_ROM_AONRTCCurrentCompareValueGet")));
xdc_Void * const ti_sysbios_rom_ROM_AONRTCCurrentCompareValueGet = (xdc_Void *)NULL;

xdc_Void * const ti_sysbios_rom_ROM_AONRTCEventClear __attribute__((section (".rodata_ti_sysbios_rom_ROM_AONRTCEventClear")));
xdc_Void * const ti_sysbios_rom_ROM_AONRTCEventClear = (xdc_Void *)NULL;


extern unsigned int __sysbios_rom_data_load__;
extern unsigned int __sysbios_rom_data_start__;
extern unsigned int __sysbios_rom_data_end__;

extern unsigned int __sysbios_data_other_load__;
extern unsigned int __sysbios_data_other_start__;
extern unsigned int __sysbios_data_other_end__;

void ti_sysbios_rom_cortexm_cc26xx_CC26xx_dataInit()
{
    unsigned int * dl;
    unsigned int * ds;
    unsigned int * de;

    dl = & __sysbios_rom_data_load__;
    ds = & __sysbios_rom_data_start__;
    de = & __sysbios_rom_data_end__;

    while (ds < de) {
        *ds = *dl;
        dl++;
        ds++;
    }

    dl = & __sysbios_data_other_load__;
    ds = & __sysbios_data_other_start__;
    de = & __sysbios_data_other_end__;

    while (ds < de) {
        *ds = *dl;
        dl++;
        ds++;
    }
}

#define REVISION_WORD 0x1001ca98

Void ti_sysbios_rom_cortexm_cc26xx_CC26xx_badRomRevision__E() {
	/* Loop here forever if application is built with wrong version of ROM image */
        while(1) {
            ;
        }
}

Void ti_sysbios_rom_cortexm_cc26xx_CC26xx_checkRevision__E()
{
    if (*((UInt32 *)(REVISION_WORD)) != 0x20284770) {
	ti_sysbios_rom_cortexm_cc26xx_CC26xx_badRomRevision__E();
    }
}


/*
 * ======== ti.sysbios.rts.gnu.ReentSupport TEMPLATE ========
 */



/*
 * ======== ti.sysbios.rts.MemAlloc TEMPLATE ========
 */



#if defined(__ti__)

#pragma FUNC_EXT_CALLED(malloc);
#pragma FUNC_EXT_CALLED(memalign);
#pragma FUNC_EXT_CALLED(free);
#pragma FUNC_EXT_CALLED(calloc);
#pragma FUNC_EXT_CALLED(realloc);

#define ATTRIBUTE

#elif defined(__IAR_SYSTEMS_ICC__)

#define ATTRIBUTE

#else

#define ATTRIBUTE __attribute__ ((used))

#endif


#include <xdc/std.h>

#include <xdc/runtime/Memory.h>
#include <xdc/runtime/Error.h>

#include <string.h>

#if defined(__GNUC__) && !defined(__ti__)

#include <reent.h>

#endif

/*
 * Header is a union to make sure that the size is a power of 2.
 *
 * On the MSP430 small model (MSP430X), size_t is 2 bytes, which makes
 * the size of this struct 6 bytes.
 */
typedef union Header {
    struct {
        Ptr   actualBuf;
        SizeT size;
    } header;
    UArg pad[2];	/* 4 words on 28L, 8 bytes on most others */
} Header;

