tomvictor/CC2650-BLE-interrupt/Debug/configPkg/package/cfg/pinInterrupt_pm3g.c
/*
 * ======== ti.sysbios.knl.Task_SupportProxy INITIALIZERS ========
 */


/*
 * ======== ti.sysbios.rom.cortexm.cc26xx.CC26xx INITIALIZERS ========
 */

/* Module__diagsEnabled__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsEnabled ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsEnabled__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsEnabled__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsEnabled ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsEnabled__C = (xdc_Bits32)0x90;

/* Module__diagsIncluded__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsIncluded ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsIncluded__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsIncluded__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsIncluded ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsIncluded__C = (xdc_Bits32)0x90;

/* Module__diagsMask__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsMask ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsMask__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsMask__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsMask ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsMask__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__diagsMask)0);

/* Module__gateObj__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gateObj ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gateObj__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gateObj__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gateObj ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gateObj__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gateObj)0);

/* Module__gatePrms__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gatePrms ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gatePrms__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gatePrms__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gatePrms ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gatePrms__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__gatePrms)0);

/* Module__id__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__id ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__id__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__id__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__id ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__id__C = (xdc_Bits16)0x2d;

/* Module__loggerDefined__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerDefined ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerDefined__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerDefined__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerDefined ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerDefined__C = 0;

/* Module__loggerObj__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerObj ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerObj__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerObj__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerObj ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerObj__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerObj)0);

/* Module__loggerFxn0__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn0 ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn0__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn0__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn0 ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn0__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn0)0);

/* Module__loggerFxn1__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn1 ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn1__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn1__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn1 ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn1__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn1)0);

/* Module__loggerFxn2__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn2 ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn2__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn2__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn2 ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn2__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn2)0);

/* Module__loggerFxn4__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn4 ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn4__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn4__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn4 ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn4__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn4)0);

/* Module__loggerFxn8__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn8 ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn8__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn8__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn8 ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn8__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__loggerFxn8)0);

/* Module__startupDoneFxn__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__startupDoneFxn ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__startupDoneFxn__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__startupDoneFxn__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__startupDoneFxn ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__startupDoneFxn__C = ((CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Module__startupDoneFxn)0);

