tomvictor/CC2650-BLE-interrupt/Debug/configPkg/package/cfg/pinInterrupt_pm3g.c
/* Object__count__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__count ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__count__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__count__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__count ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__count__C = 0;

/* Object__heap__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__heap ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__heap__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__heap__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__heap ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__heap__C = 0;

/* Object__sizeof__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__sizeof ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__sizeof__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__sizeof__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__sizeof ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__sizeof__C = 0;

/* Object__table__C */
const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__table ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__table__C __attribute__ ((section (".rodata_ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__table__C")));
__FAR__ const CT__ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__table ti_sysbios_rom_cortexm_cc26xx_CC26xx_Object__table__C = 0;


/*
 * ======== ti.sysbios.rts.gnu.ReentSupport INITIALIZERS ========
 */

/* Module__state__V */
#if defined (__ICCARM__)
#pragma location = ".data_ti_sysbios_rts_gnu_ReentSupport_Module__state__V"
#endif
#if defined(__GNUC__) && !(defined(__MACH__) && defined(__APPLE__))
#ifndef __TI_COMPILER_VERSION__
ti_sysbios_rts_gnu_ReentSupport_Module_State__ ti_sysbios_rts_gnu_ReentSupport_Module__state__V __attribute__ ((section(".data_ti_sysbios_rts_gnu_ReentSupport_Module__state__V")));
#endif
#endif
ti_sysbios_rts_gnu_ReentSupport_Module_State__ ti_sysbios_rts_gnu_ReentSupport_Module__state__V = {
    (xdc_Int)0x0,  /* taskHId */
    0,  /* lock */
};

/* Module__diagsEnabled__C */
const CT__ti_sysbios_rts_gnu_ReentSupport_Module__diagsEnabled ti_sysbios_rts_gnu_ReentSupport_Module__diagsEnabled__C __attribute__ ((section (".rodata_ti_sysbios_rts_gnu_ReentSupport_Module__diagsEnabled__C")));
__FAR__ const CT__ti_sysbios_rts_gnu_ReentSupport_Module__diagsEnabled ti_sysbios_rts_gnu_ReentSupport_Module__diagsEnabled__C = (xdc_Bits32)0x90;

/* Module__diagsIncluded__C */
const CT__ti_sysbios_rts_gnu_ReentSupport_Module__diagsIncluded ti_sysbios_rts_gnu_ReentSupport_Module__diagsIncluded__C __attribute__ ((section (".rodata_ti_sysbios_rts_gnu_ReentSupport_Module__diagsIncluded__C")));
__FAR__ const CT__ti_sysbios_rts_gnu_ReentSupport_Module__diagsIncluded ti_sysbios_rts_gnu_ReentSupport_Module__diagsIncluded__C = (xdc_Bits32)0x90;

/* Module__diagsMask__C */
const CT__ti_sysbios_rts_gnu_ReentSupport_Module__diagsMask ti_sysbios_rts_gnu_ReentSupport_Module__diagsMask__C __attribute__ ((section (".rodata_ti_sysbios_rts_gnu_ReentSupport_Module__diagsMask__C")));
__FAR__ const CT__ti_sysbios_rts_gnu_ReentSupport_Module__diagsMask ti_sysbios_rts_gnu_ReentSupport_Module__diagsMask__C = ((CT__ti_sysbios_rts_gnu_ReentSupport_Module__diagsMask)0);

/* Module__gateObj__C */
const CT__ti_sysbios_rts_gnu_ReentSupport_Module__gateObj ti_sysbios_rts_gnu_ReentSupport_Module__gateObj__C __attribute__ ((section (".rodata_ti_sysbios_rts_gnu_ReentSupport_Module__gateObj__C")));
__FAR__ const CT__ti_sysbios_rts_gnu_ReentSupport_Module__gateObj ti_sysbios_rts_gnu_ReentSupport_Module__gateObj__C = ((CT__ti_sysbios_rts_gnu_ReentSupport_Module__gateObj)0);

/* Module__gatePrms__C */
const CT__ti_sysbios_rts_gnu_ReentSupport_Module__gatePrms ti_sysbios_rts_gnu_ReentSupport_Module__gatePrms__C __attribute__ ((section (".rodata_ti_sysbios_rts_gnu_ReentSupport_Module__gatePrms__C")));
__FAR__ const CT__ti_sysbios_rts_gnu_ReentSupport_Module__gatePrms ti_sysbios_rts_gnu_ReentSupport_Module__gatePrms__C = ((CT__ti_sysbios_rts_gnu_ReentSupport_Module__gatePrms)0);

/* Module__id__C */
const CT__ti_sysbios_rts_gnu_ReentSupport_Module__id ti_sysbios_rts_gnu_ReentSupport_Module__id__C __attribute__ ((section (".rodata_ti_sysbios_rts_gnu_ReentSupport_Module__id__C")));
__FAR__ const CT__ti_sysbios_rts_gnu_ReentSupport_Module__id ti_sysbios_rts_gnu_ReentSupport_Module__id__C = (xdc_Bits16)0x2e;

/* Module__loggerDefined__C */
const CT__ti_sysbios_rts_gnu_ReentSupport_Module__loggerDefined ti_sysbios_rts_gnu_ReentSupport_Module__loggerDefined__C __attribute__ ((section (".rodata_ti_sysbios_rts_gnu_ReentSupport_Module__loggerDefined__C")));
__FAR__ const CT__ti_sysbios_rts_gnu_ReentSupport_Module__loggerDefined ti_sysbios_rts_gnu_ReentSupport_Module__loggerDefined__C = 0;

/* Module__loggerObj__C */
const CT__ti_sysbios_rts_gnu_ReentSupport_Module__loggerObj ti_sysbios_rts_gnu_ReentSupport_Module__loggerObj__C __attribute__ ((section (".rodata_ti_sysbios_rts_gnu_ReentSupport_Module__loggerObj__C")));
__FAR__ const CT__ti_sysbios_rts_gnu_ReentSupport_Module__loggerObj ti_sysbios_rts_gnu_ReentSupport_Module__loggerObj__C = ((CT__ti_sysbios_rts_gnu_ReentSupport_Module__loggerObj)0);

/* Module__loggerFxn0__C */
const CT__ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn0 ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn0__C __attribute__ ((section (".rodata_ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn0__C")));
__FAR__ const CT__ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn0 ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn0__C = ((CT__ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn0)0);

/* Module__loggerFxn1__C */
const CT__ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn1 ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn1__C __attribute__ ((section (".rodata_ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn1__C")));
__FAR__ const CT__ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn1 ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn1__C = ((CT__ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn1)0);

/* Module__loggerFxn2__C */
const CT__ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn2 ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn2__C __attribute__ ((section (".rodata_ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn2__C")));
__FAR__ const CT__ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn2 ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn2__C = ((CT__ti_sysbios_rts_gnu_ReentSupport_Module__loggerFxn2)0);

