tomvictor/CC2650-BLE-interrupt/Debug/configPkg/package/cfg/pinInterrupt_pm3g.c
/*
 * ======== xdc.runtime.Types PRAGMAS ========
 */

const CT__xdc_runtime_Types_Module__diagsEnabled xdc_runtime_Types_Module__diagsEnabled__C __attribute__ ((externally_visible));
const CT__xdc_runtime_Types_Module__diagsIncluded xdc_runtime_Types_Module__diagsIncluded__C __attribute__ ((externally_visible));
const CT__xdc_runtime_Types_Module__diagsMask xdc_runtime_Types_Module__diagsMask__C __attribute__ ((externally_visible));
const CT__xdc_runtime_Types_Module__gateObj xdc_runtime_Types_Module__gateObj__C __attribute__ ((externally_visible));
const CT__xdc_runtime_Types_Module__gatePrms xdc_runtime_Types_Module__gatePrms__C __attribute__ ((externally_visible));
const CT__xdc_runtime_Types_Module__id xdc_runtime_Types_Module__id__C __attribute__ ((externally_visible));
const CT__xdc_runtime_Types_Module__loggerDefined xdc_runtime_Types_Module__loggerDefined__C __attribute__ ((externally_visible));
const CT__xdc_runtime_Types_Module__loggerObj xdc_runtime_Types_Module__loggerObj__C __attribute__ ((externally_visible));
const CT__xdc_runtime_Types_Module__loggerFxn0 xdc_runtime_Types_Module__loggerFxn0__C __attribute__ ((externally_visible));
const CT__xdc_runtime_Types_Module__loggerFxn1 xdc_runtime_Types_Module__loggerFxn1__C __attribute__ ((externally_visible));
const CT__xdc_runtime_Types_Module__loggerFxn2 xdc_runtime_Types_Module__loggerFxn2__C __attribute__ ((externally_visible));
const CT__xdc_runtime_Types_Module__loggerFxn4 xdc_runtime_Types_Module__loggerFxn4__C __attribute__ ((externally_visible));
const CT__xdc_runtime_Types_Module__loggerFxn8 xdc_runtime_Types_Module__loggerFxn8__C __attribute__ ((externally_visible));
const CT__xdc_runtime_Types_Module__startupDoneFxn xdc_runtime_Types_Module__startupDoneFxn__C __attribute__ ((externally_visible));
const CT__xdc_runtime_Types_Object__count xdc_runtime_Types_Object__count__C __attribute__ ((externally_visible));
const CT__xdc_runtime_Types_Object__heap xdc_runtime_Types_Object__heap__C __attribute__ ((externally_visible));
const CT__xdc_runtime_Types_Object__sizeof xdc_runtime_Types_Object__sizeof__C __attribute__ ((externally_visible));
const CT__xdc_runtime_Types_Object__table xdc_runtime_Types_Object__table__C __attribute__ ((externally_visible));
xdc_Bool xdc_runtime_Types_Module__startupDone__S(void) __attribute__ ((externally_visible));

/*
 * ======== INITIALIZATION ENTRY POINT ========
 */

extern int __xdc__init(void);
#ifdef __GNUC__
#ifndef __TI_COMPILER_VERSION__
    __attribute__ ((externally_visible))
#endif
#endif
__FAR__ int (* volatile __xdc__init__addr)(void) = &__xdc__init;


/*
 * ======== PROGRAM GLOBALS ========
 */

